In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":["rohan","seema","mahesh","shruti"],
    "marks":[9,55,67,98],
    "city":["Delhi","Jaipur","Rampur","Barilly"]
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks     city
0   rohan      9    Delhi
1   seema     55   Jaipur
2  mahesh     67   Rampur
3  shruti     98  Barilly

In [5]:
df.index=[1,2,3,4]

In [6]:
df

     name  marks     city
1   rohan      9    Delhi
2   seema     55   Jaipur
3  mahesh     67   Rampur
4  shruti     98  Barilly

In [7]:
ser=pd.Series(np.random.rand(20))

In [8]:
ser

0     0.190807
1     0.801572
2     0.533820
3     0.090603
4     0.410884
5     0.558282
6     0.290774
7     0.658062
8     0.067524
9     0.652677
10    0.378773
11    0.323924
12    0.634147
13    0.224985
14    0.567029
15    0.948002
16    0.688387
17    0.544939
18    0.539194
19    0.352761
dtype: float64

In [9]:
type(ser)

pandas.Series

In [10]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [11]:
newdf

            0         1         2         3         4
0    0.305982  0.353860  0.252570  0.635770  0.729189
1    0.672219  0.508101  0.623509  0.944472  0.510946
2    0.824620  0.360539  0.265605  0.837405  0.920573
3    0.217376  0.294108  0.494432  0.968634  0.628245
4    0.953909  0.782078  0.357268  0.714800  0.823621
..        ...       ...       ...       ...       ...
329  0.284520  0.897793  0.173969  0.730645  0.704301
330  0.307293  0.726710  0.352309  0.121994  0.534449
331  0.149057  0.329600  0.774839  0.826711  0.410268
332  0.163955  0.464528  0.189348  0.879086  0.653240
333  0.703913  0.988091  0.701784  0.499507  0.381824

[334 rows x 5 columns]

In [12]:
newdf.head(3)

          0         1         2         3         4
0  0.305982  0.353860  0.252570  0.635770  0.729189
1  0.672219  0.508101  0.623509  0.944472  0.510946
2  0.824620  0.360539  0.265605  0.837405  0.920573

In [13]:
newdf.tail(3)

            0         1         2         3         4
331  0.149057  0.329600  0.774839  0.826711  0.410268
332  0.163955  0.464528  0.189348  0.879086  0.653240
333  0.703913  0.988091  0.701784  0.499507  0.381824

In [14]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.305982  0.353860  0.252570  0.635770  0.729189
1    0.672219  0.508101  0.623509  0.944472  0.510946
2    0.824620  0.360539  0.265605  0.837405  0.920573
3    0.217376  0.294108  0.494432  0.968634  0.628245
4    0.953909  0.782078  0.357268  0.714800  0.823621
..        ...       ...       ...       ...       ...
329  0.284520  0.897793  0.173969  0.730645  0.704301
330  0.307293  0.726710  0.352309  0.121994  0.534449
331  0.149057  0.329600  0.774839  0.826711  0.410268
332  0.163955  0.464528  0.189348  0.879086  0.653240
333  0.703913  0.988091  0.701784  0.499507  0.381824

[334 rows x 5 columns]

In [15]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.353860  0.252570  0.635770  0.729189
1    0.508101  0.623509  0.944472  0.510946
2    0.360539  0.265605  0.837405  0.920573
3    0.294108  0.494432  0.968634  0.628245
4    0.782078  0.357268  0.714800  0.823621
..        ...       ...       ...       ...
329  0.897793  0.173969  0.730645  0.704301
330  0.726710  0.352309  0.121994  0.534449
331  0.329600  0.774839  0.826711  0.410268
332  0.464528  0.189348  0.879086  0.653240
333  0.988091  0.701784  0.499507  0.381824

[334 rows x 4 columns]

In [ ]:
newdf.dropna(inplace=True)